!****************************************************************************
!
!  PROGRAM: exam_8_11
!
!  PURPOSE: 假定大小的数组作为形参（Fortran95标准已不推荐使用）
!  
!  PROGRAMMER: 向志海
!
!  DATE: April 10, 2006
!****************************************************************************

	program exam_8_11

	implicit none

	! 变量定义
   integer(4) a(6), b(2,3)

!--- 给数组赋初值 ---
   a = (/1:6/)
   b = reshape((/6:1:-1/), shape(b))
	
!--- 数组元素仍然按列排列 ---
   print *, '1st call:'
   call sub(b, a)

   print *
   print *, '2nd call:'
   call sub(a, b)

	end program exam_8_11

!=====================================================================
! 假定大小数组的部分维的大小可以由输入参数决定，但至少有一维的大小不定
! （用*表示）。所需的内存空间是形参数组名代表的内存空间，子程序结束时，
! 该内存仍然保留
!(2014.4.22加)假定大小数组与实参结合时，假定大小的数组的未知维由实在数组确定
!=====================================================================
   subroutine sub(a, b)
   implicit none
   integer(4) a(2,*), b(*)
   integer(4) i, j

!--- 由于数组大小未知，故不能进行数组整体操作 ---
!   a = 2

!--- 未知部分的元素仍然是可以被访问的 ---   
   print *, 'a:'
   do i = 1, 2
      print *, (a(i,j), j = 1, 3) !ubound(a,2)) ! 假设大小数组的上界是未知的
   enddo

   print *
   print *, 'b:'
   print *, (b(i), i = 1, 8)  ! 越界，但不报错。很危险


!--- 由于数组大小未知，故不能进行数组整体操作 ---
!   print *, b

   end