!****************************************************************************
!
!  PROGRAM: exam_5_4
!
!  PURPOSE: 求方程x^3 + 9.2 * x^2 + 16.7 * x + 4 = 0 在 x=0 附近的根
!  
!  PROGRAMMER: 向志海
!
!  DATE: March 20, 2007
!****************************************************************************

	program exam_5_4

	implicit none

	! 变量定义
   real*8     x1, x2    ! 两个变量用于记录迭代产生的中间值。迭代收敛时x1和x2应该
                        ! 近似相等，且近似等于真实的根
   real*8     fx        ! fx = x^3 + 9.2 * x^2 + 16.7 * x + 4
   real*8     dfx       ! fx对x的导数
   integer :: iter = 0  ! 记录迭代次数

	! 因为计算x＝0附近的根，所以给x1赋初值0
   x1 = 1.0_8

   ! 用牛顿法迭代求解方程的根
   do
      fx  = x1 ** 3 + 9.2 * x1 * x1 + 16.7 * x1 + 4.0
      dfx = 3.0 * x1 * x1 + 18.4 * x1 + 16.7
      x2  = x1 - fx / dfx

      ! 输出中间结果
      print *, 'Iteration: ', iter
      print *, 'x1  = ', x1, ' fx1 = ', fx
      print *, 'x2  = ', x2, ' fx2 = ', x2 ** 3 + 9.2 * x2 * x2 + 16.7 * x2 + 4.0

      ! 收敛检查
      if(abs(x2 - x1) .lt. 1.0d-6) exit
      
      ! 准备下一次迭代
      iter = iter + 1
      x1   = x2
   enddo

   ! 打印结果
   print *, '----------------------------------------------------------------'
   print *, 'x  = ', x2
   print *, 'fx = ', x2 ** 3 + 9.2 * x2 * x2 + 16.7 * x2 + 4.0

	end program exam_5_4
