!****************************************************************************
!
!  PROGRAM: exam_6_7
!
!  PURPOSE: 输入输出表和格式说明表之间的关系 
!  
!  PROGRAMMER: 向志海
!
!  DATE: March 12, 2006
!****************************************************************************

	program exam_6_7

	implicit none

	! 变量定义
   integer(4) i, j
   real(4)    a

!--- 输入变量、输出表达式和格式说明不匹配时会产生错误 ---
   print *, '输入两个整数'
	read(*,10) i, a
10 format(2i2)
   write(*,*) 'i = ', i, ' a = ', a

   write(*,20) 3
20 format(f3.1)

!--- 输入变量、输出表达式项的个数小于格式说明的项数 ---
   ! 多余的格式说明项无用
   print *, 'Press any key to continue...'
   read(*,*)         !  相当于pause
   write(*,*)

!--- 输入变量、输出表达式项的个数大于于格式说明的项数 ---
   ! 无重复次数编辑符时，所有格式说明项会重复使用，并且换行
   print *, '输入两个整数'
   read(*,30) i, j
30 format(i2)

   write(*,40) 'i = ', i, 'j = ', j
40 format(1x, a, i2)

   ! 有重复次数编辑符时，只重复使用最后重复的格式说明项，并且换行
   write(*,50) 1.0, 2.0, 3.0, 4.0, 5.0, 6.0, 7.0, 8.0
50 format(1x, 2(f6.1, 1x), 1x, 2(f6.2, 1x), f6.3)

	end program exam_6_7

