!****************************************************************************
!
!  PROGRAM: exam_7_1
!
!  PURPOSE: 数组的声明和简单赋值
!  
!  PROGRAMMER: 向志海
!
!  DATE: March 20, 2006
!****************************************************************************

	program exam_7_1

	implicit none

!--- 数组的声明 ---
	! 直接用类型说明语句声明（可以用数组构造器直接赋初值，每个数组元素都要赋初值）
   integer(4)   i
   integer(4)   a(5), aa(2:2), aaa(2:1)         ! size of aaa = 0
   real(4)::    b(2,2) = (/1.0, 2.0, 0.0, 4.0/) ! no space between ( and / 
   real(4)      c(0:3, -2:7, 1:2)
   real(4)      d(3:1, 2:2)
   character(2) ch(3)
   logical(1)   lg(2,3)

   ! 用dimension语句声明（不能直接赋初值）
   integer(4)  e
   dimension:: e(10), f(2,3)
   integer(4)  f

   ! 用类型说明语句和dimension语句声明（可以直接赋初值，每个数组元素都要赋初值）
   real(8), dimension(2:5, 3):: g, h(3) = [0.0_8, 1.0_8, 2.0_8]

!--- 数组的简单赋值 ---
   ! 用data语句给数组赋值（只能是常数，可加重复符）
   data i /-1/, f /1, 2, 2 * 0, 3, 4/      ! 按列存储, *表示重复
!   data a /1:5/                           ! data里不支持三元组
   data a(1:3) /3 * 1/
   data a(1:4) /3 * -1, 2/

   ! 整体赋值
   a = 1
   a = e(2:6)   ! 等号左右数组的形状必须一致

   ! 单个数组元素赋值
   do i = 1, 5
      a(i) = 2
   enddo

   ! 数组片段赋值
   a(1:4) = 3

   ! 用数组构造器赋值
   i = 1
   a = (/0, i - 1, abs(-1) - 1, (0, i = 1, 2)/) ! 数组构造器中可以有变量和函数
   
   a = [(1, i = 1, 5)]  ! 数组构造器的另一种形式

   a = (/5:1:-1/)       ! 数组构造器中可以包含三元组

   a(1:5:2) = (/(0, i = 1, 5, 2)/)        ! 向量下标

   e = (/2:4:2, a(2:4:2), (0, i = 1, 6)/) ! 数组构造器中可以有数组片段

   a(e(1:2)) = -1                         ! 向量下标
   
  ! a(e(1:5)) = -1                         ! 注意数组越界

   ! 改变一维数组的形状，然后赋给多维数组（按列存储）
   !f = (/1:6/)
   f = reshape((/1:6/), shape(f)) !(/2,3/))

	end program exam_7_1

