!****************************************************************************
!
!  PROGRAM: exam_5_2
!
!  PURPOSE: do语句示例
!  
!  PROGRAMMER: 向志海
!
!  DATE:     March  4, 2006
!  MODIFIED: March 11, 2009
!****************************************************************************

	program exam_5_2

	implicit none

	! 变量定义
   integer(4)  i, l, m, n
    

	! 在do循环体中，可以改变循环初值、终值和步长变量，但不影响循环次数
   ! 在do循环体中，不可以改变循环变量
   l = 1
   m = 1
   n = 5
   print *, '          i           m           n           l'
   print *, '-----------------------------------------------'
   do i = m, n + 5, l + 1
      print *, i, m, n, l
      m = m + 1
      n = n + 1
      l = l * 2 + 1
!      i = i + 2
   enddo

   ! 在do循环退出后，循环变量仍然有意义
   print *, 'i = ', i
	
	end program exam_5_2

